{"basics":{"name":"Yuejie Wang","image":"","email":"kathywangyuejie@gmail.com","phone":"(+86)13621340030","url":"https://yuejiewang.github.io/","summary":"A Ph.D. student in Computer Science."},"education":[{"institution":"New York University Shanghai","location":"Shanghai, China","url":"https://www.shanghai.nyu.edu/","major":"Computer Science","levelOfStudy":"PhD","startDate":"2022-09","endDate":""},{"institution":"New York University","location":"New York, USA","url":"https://www.nyu.edu/","major":"Computer Science","levelOfStudy":"Master of Science","startDate":"2020-09","endDate":"2022-05"},{"institution":"Peking University","location":"Beijing, China","url":"https://www.pku.edu.cn/","major":"Computer Science","levelOfStudy":"Bachelor of Science","startDate":"2016-09","endDate":"2020-07"}],"publications":[{"name":"ConfMask: Enabling Privacy-Preserving Configuration Sharing via Anonymization","publisher":"ACM SIGCOMM 2024 Conference","authors":"Yuejie Wang, Qiutong Men, Yao Xiao, Yongting Chen, Guyue Liu","summary":"Real-world network configurations play a critical role in network management and research tasks. While valuable, data holders often hesitate to share them due to business and privacy concerns. Existing methods are deficient in concealing the implicit information that can be inferred from configurations, such as topology and routing paths. To address this, we present ConfMask, a novel framework designed to systematically anonymize network topology and routing paths in configurations. Our approach tackles key privacy, utility, and scalability challenges, which arise from the strong dependency between different datasets and complex routing protocols. Our anonymization algorithm is scalable to large networks and effectively mitigates de-anonymization risk. Moreover, it maintains essential network properties such as reachability, waypointing and multi-path consistency, making it suitable for a wide range of downstream tasks. Compared to existing data plane anonymization algorithm (i.e., NetHide), ConfMask reduces ∼75% specification differences between the original and the anonymized networks."},{"name":"Simple Rule Injection for ComplEx Embeddings","publisher":"arXiv preprint arXiv:2308.03269","authors":"Haodi Ma, Anthony Colas, Yuejie Wang, Ali Sadeghian, Daisy Zhe Wang","summary":"Recent works in neural knowledge graph inference attempt to combine logic rules with knowledge graph embeddings to benefit from prior knowledge. However, they usually cannot avoid rule grounding, and injecting a diverse set of rules has still not been thoroughly explored. In this work, we propose InjEx, a mechanism to inject multiple types of rules through simple constraints, which capture definite Horn rules. To start, we theoretically prove that InjEx can inject such rules. Next, to demonstrate that InjEx infuses interpretable prior knowledge into the embedding space, we evaluate InjEx on both the knowledge graph completion (KGC) and few-shot knowledge graph completion (FKGC) settings. Our experimental results reveal that InjEx outperforms both baseline KGC models as well as specialized few-shot models while maintaining its scalability and efficiency."},{"name":"A practical approach to forgetting in description logics with nominals","publisher":"Proceedings of the AAAI Conference on Artificial Intelligence","authors":"Yizheng Zhao, Renate Schmidt, Yuejie Wang, Xuanming Zhang, Hao Feng","summary":"This paper investigates the problem of forgetting in description logics with nominals. In particular, we develop a practical method for forgetting concept and role names from ontologies specified in the description logic ALCO, extending the basic ALC with nominals. The method always terminates, and is sound in the sense that the forgetting solution computed by the method has the same logical consequences with the original ontology. The method is so far the only approach to deductive forgetting in description logics with nominals. An evaluation of a prototype implementation shows that the method achieves a significant speed-up and notably better success rates than the Lethe tool which performs deductive forgetting for ALC-ontologies. Compared to Fame, a semantic forgetting tool for ALCOIH-ontologies, better success rates are attained. From the perspective of ontology engineering this is very useful, as it provides ontology curators with a powerful tool to produce views of ontologies."},{"name":"A Robust IoT‐Based Three‐Factor Authentication Scheme for Cloud Computing Resistant to Session Key Exposure","publisher":"Wireless Communications and Mobile Computing","authors":"Feifei Wang, Guosheng Xu, Guoai Xu, Yuejie Wang, Junhao Peng","summary":"With the development of Internet of Things (IoT) technologies, Internet-enabled devices have been widely used in our daily lives. As a new service paradigm, cloud computing aims at solving the resource-constrained problem of Internet-enabled devices. It is playing an increasingly important role in resource sharing. Due to the complexity and openness of wireless networks, the authentication protocol is crucial for secure communication and user privacy protection. In this paper, we discuss the limitations of a recently introduced IoT-based authentication scheme for cloud computing. Furthermore, we present an enhanced three-factor authentication scheme using chaotic maps. The session key is established based on Chebyshev chaotic-based Diffie–Hellman key exchange. In addition, the session key involves a long-term secret. It ensures that our scheme is secure against all the possible session key exposure attacks. Besides, our scheme can effectively update user password locally. Burrows–Abadi–Needham logic proof confirms that our scheme provides mutual authentication and session key agreement. The formal analysis under random oracle model proves the semantic security of our scheme. The informal analysis shows that our scheme is immune to diverse attacks and has desired features such as three-factor secrecy. Finally, the performance comparisons demonstrate that our scheme provides optimal security features with an acceptable computation and communication overheads."}]"languages":[{"language":"Chinese","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""}]}